export const DATA = [
  {
    weight: 100,
    name: "冒険者たちは悪役一味と対決し、どちらかが全滅するまで戦う。",
  },
  {
    weight: 100,
    name:
      "冒険者たちは悪役が配置した障害物を避けながら悪役を追いかけた末、悪役の隠れ家の中またはすぐ外で最終決戦が始まる。",
  },
  {
    weight: 50,
    name:
      "冒険者の行動によって天変地異が生じ、冒険者たちは逃げ出さざるを得なくなる。",
  },
  {
    weight: 50,
    name:
      "悪役の行動によって天変地異が生じ、冒険者たちは逃げ出さざるを得なくなる。",
  },
  {
    weight: 100,
    name:
      "冒険者たちは悪役が主目的を達成しようとしている場所に急行し、達成寸前のタイミングでぎりぎり間に合う。",
  },
  {
    weight: 50,
    name:
      "悪役とその腹心数名が大きな部屋のあちこちで別々の儀式を行なっている。冒険者たちはすべての儀式を同時に妨害しなければならない。",
  },
  {
    weight: 100,
    name:
      "他の次元界に通じるポータル(転移門)が開き、向こう側のクリーチャーどもがこちら側に押し寄せてくる。冒険者たちはポータルの封鎖と悪役の退治を同時並行でこなさなければならない。",
  },
  {
    weight: 30,
    name:
      "悪役の親玉が襲いかかってきた瞬間、罠が冒険者たちに牙をむく。",
  },
  {
    weight: 30,
    name:
      "悪役の親玉が襲いかかってきた瞬間、危険要因が冒険者たちに牙をむく。",
  },
  {
    weight: 30,
    name:
      "悪役の親玉が襲いかかってきた瞬間、買、アニメイテッド·オブジェクトが冒険者たちに牙をむく。",
  },
  {
    weight: 100,
    name:
      "冒険者たちが悪役の親玉を追い詰めたその時、ダンジョンが崩れ始め、悪役は混乱に乗じて逃走をはかる。",
  },
  {
    weight: 50,
    name:
      "冒険者たちより強い何ものかが現れて悪役の親玉を滅ぼし、次いでキャラクターたちに注意を向ける。",
  },
  {
    weight: 100,
    name:
      "冒険者たちは決断を迫られる。逃げた悪役を追うか、それとも大切なNPCないし罪のない人々を守るか。",
  },
  {
    weight: 50,
    name:
      "冒険者たちが悪役に勝てる可能性があるとしたら、悪役の弱みを探り当てる他にない。",
  },
  {
    weight: 20,
    name:
      "冒険者たちは目的を達成する寸前に味方に裏切られる。",
  },
];
