export const DATA = [
  "野外を旅していたキャラクターたちの足元が突然崩れ、陥没孔に飲み込まれる。落ちた先がアドベンチャーの舞台となる場所だ。",
  "野外を旅していたキャラクターたちはアドベンチャーの舞台となる場所の入り口を発見する。",
  "街道を旅していたキャラクターたちはモンスターに襲われる。撃退されたモンスターが逃げていく先にアドベンチャーの舞台となる場所がある。",
  "冒険者たちは死体が持っていた地図を見つける。地図はアドベンチャーの入口になるだけでなく、悪役もまた同じ地図を欲している。",
  "謎めいた魔法のアイテムまたは冷酷な悪役が、キャラクターたちをアドベンチャーの舞台となる場所へ瞬間移動させる。",
  "見知らぬ人物が酒場でキャラクターたちに近寄って来て、アドベンチャーの舞台となる場所へ向かえとすすめる。",
  "町や村で、アドベンチャーの舞台となる場所へ行ってくれる人物を募集している。",
  "キャラクターたちが大切に思っているNPCのために、アドベンチャーの舞台となる場所へ行く必要が生じる。",
  "キャラクターたちに命令できるNPCが、アドベンチャーの舞台となる場所へ行けと命令してくる。",
  "キャラクターたちが尊敬しているNPCが、アドベンチャーの舞台となる場所へ行ってくれと頼んでくる。",
  "ある晩、キャラクター全員が同じ夢を見る。アドベンチヤーの舞台となる場所に入ってゆく夢を。",
  "村に亡霊が現れて人心を脅かしている。調査の結果、アドベンチャーの舞台となる場所に行かない限りこの亡霊をが遠に眠らせることはできないと分かる。",
];
