import Table from '@/models/Table';
import List from '@/models/List';
import Matrix from '@/models/Matrix';

export enum Difficulty {
  Easy = 0,
  Normal,
  Hard,
  Deadly,
}

export const NUM_MODIFY = new Table([
  [1, 1],
  [2, 1.5],
  [3, 2],
  [7, 2.5],
  [11, 3],
  [15, 4],
]);

export const CR = new List(
  10,
  25,
  50,
  100,
  200,
  450,
  700,
  1100,
  1800,
  2300,
  2900,
  3900,
  5000,
  5900,
  7200,
  18000,
);

export const EXP = new Table<string>([
  [10, '0'],
  [25, '1/8'],
  [50, '1/4'],
  [100, '1/2'],
  [200, '1'],
  [450, '2'],
  [700, '3'],
  [1100, '4'],
  [1800, '5'],
  [2300, '6'],
  [2900, '7'],
  [3900, '8'],
  [5000, '9'],
  [5900, '10'],
  [7200, '11'],
  [8400, '12'],
  [10000, '13'],
]);

export const BASE_EXP = new Matrix(
  [25, 50, 75, 100],
  [50, 100, 150, 200],
  [75, 150, 225, 400],
  [125, 250, 375, 500],
  [250, 500, 750, 1100],
  [300, 600, 900, 1400],
  [350, 750, 1100, 1700],
  [450, 900, 1400, 2100],
  [550, 1100, 1600, 2400],
  [600, 1200, 1900, 2800],
);

export const ADVANCEMENT = new Table<number> ([
  [0, 1],
  [300, 2],
  [900, 3],
  [2700, 4],
  [6500, 5],
  [14000, 6],
  [23000, 7],
  [34000, 8],
  [48000, 9],
  [64000, 10],
]);

export const RACE_ABILITY = new Map<string, number[]> ([
  ['ヒューマン', [1, 1, 1, 1, 1, 1]],
  ['マウンテンドワーフ', [2, 0, 2, 0, 0, 0]],
  ['ヒルドワーフ', [0, 0, 2, 0, 1, 0]],
  ['ハイエルフ', [0, 2, 0, 1, 0, 0]],
  ['ウッドエルフ', [0, 2, 0, 0, 1, 0]],
  ['スタウトハーフリング', [0, 2, 1, 0, 0, 0]],
  ['ライトフットハーフリング', [0, 2, 0, 0, 0, 1]],
]);

export const RACES = Array.from(RACE_ABILITY.keys());

export const BACKGROUND_SKILLS = new Map<string, string[]> ([
  ['貴族', ['説得', '歴史']],
  ['賢者', ['魔法学', '歴史']],
  ['侍祭', ['看破', '宗教学']],
  ['犯罪者', ['隠密', 'ペテン']],
  ['兵士', ['威圧', '運動']],
  ['民衆英雄', ['生存', '動物使い']],
]);

export const BACKGROUND = Array.from(BACKGROUND_SKILLS.keys());

export const ALIGNMENT = [
  '秩序にして善',
  '中立にして善',
  '混沌にして善',
  '秩序にして中立',
  '真なる中立',
  '混沌にして中立',
  '秩序にして悪',
  '中立にして悪',
  '混沌にして悪',
];

export const KLASS = [
  'ファイター',
  'マジックユーザー',
  'クレリック',
  'ローグ',
  'レンジャー',
  'パラディン',
  'バーバリアン',
  'ソーサラー',
  'モンク',
  'ウォーロック',
  'ドルイド',
];
