const RACE_ABILITY = new Map<string, number[]> ([
  ['ヒューマン', [1, 1, 1, 1, 1, 1]],
  ['マウンテンドワーフ', [2, 0, 2, 0, 0, 0]],
  ['ヒルドワーフ', [0, 0, 2, 0, 1, 0]],
  ['ハイエルフ', [0, 2, 0, 1, 0, 0]],
  ['ウッドエルフ', [0, 2, 0, 0, 1, 0]],
  ['頑丈ハーフリング', [0, 2, 1, 0, 0, 0]],
  ['速足ハーフリング', [0, 2, 0, 0, 0, 1]],
  ['ドラウ', [0, 2, 0, 0, 0, 1]],
  ['ティーフリング', [0, 0, 0, 1, 0, 2]],
  ['ドラゴンボーン', [2, 0, 0, 0, 0, 1]],
  ['森ノーム', [0, 1, 0, 2, 0, 0]],
  ['岩ノーム', [0, 0, 1, 2, 0, 0]],
  ['ハーフエルフ', [0, 0, 0, 0, 0, 2]],
  ['ハーフオーク', [2, 0, 1, 0, 0, 0]],
]);

export default RACE_ABILITY;
